# GrayClass

## Description
Sets the visibility of the specified class to grayed status.

```pascal
PROCEDURE GrayClass(className : STRING);
```

```python
def vs.GrayClass(className):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|className|STRING|Name of class.|

## Remarks
[sd 8/18/98]

## Examples
==== VectorScript ====
```pascal
GrayClass('Phase 2 Construction');
```
==== Python ====
```python
vs.GrayClass('Phase 2 Construction')
```

## Version
Availability: from VectorWorks8.0

## Category
* Classes